public class Main {

    /*
    Для выполнения http  запросов начиная с 11 Джавы появились следующие  4 класса :
    HttpClient
    HttpRequest
    HttpResponse
    WebSocket


    SpringBoot -
    Преимущества SpringBoot
    1. не требует развертывания war-файлы
    2. создает автомные приложения
    3.непосредственно встраивает Tomcat
    4.прост в настройке и имеет дополнительные функциональности "из коробки"
    5. значительно уменьшает обьем исходного кода


    MVC - Model-View-Controller
    Model (модель) -  содержит бизнес-логику приложения
    View (Вид) - отвечает за отображение данных пользователю
    Controller (контроллер) - отвечает за обработку действий пользователя
     */

}
